## Plan Result (stg_lb)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_lb_backend_address_pool.backend[&#34;crime-portal-bap02-stg&#34;]
  * azurerm_lb_backend_address_pool_address.backend_vm_ip_address[&#34;crime-portal-bap02-stg-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_lb_backend_address_pool_address.backend_vm_ip_address[&#34;crime-portal-bap02-stg-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_lb_probe.probe[&#34;crime-portal-probe02-stg&#34;]
* Update
  * azurerm_lb.lb
  * azurerm_lb_rule.rule[&#34;crime-portal-rule01-stg&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_lb.lb will be updated in-place
  ~ resource "azurerm_lb" "lb" {
        id                   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/loadBalancers/crime-portal-lb-stg"
        name                 = "crime-portal-lb-stg"
        tags                 = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (6 unchanged attributes hidden)

      + frontend_ip_configuration {
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "crime-portal-feip02-stg"
          + outbound_rules                = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + subnet_id                     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg"
          + zones                         = [
              + "1",
              + "2",
              + "3",
            ]
        }

        # (1 unchanged block hidden)
    }

  # azurerm_lb_backend_address_pool.backend["crime-portal-bap02-stg"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/loadBalancers/crime-portal-lb-stg"
      + name                      = "crime-portal-bap02-stg"
      + outbound_rules            = (known after apply)
    }

  # azurerm_lb_backend_address_pool_address.backend_vm_ip_address["crime-portal-bap02-stg-crime-portal-frontend-vm01-stg"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_vm_ip_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.25.246.20"
      + name                          = "crime-portal-frontend-vm01-stg"
      + virtual_network_id            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01"
    }

  # azurerm_lb_backend_address_pool_address.backend_vm_ip_address["crime-portal-bap02-stg-crime-portal-frontend-vm02-stg"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_vm_ip_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.25.246.21"
      + name                          = "crime-portal-frontend-vm02-stg"
      + virtual_network_id            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01"
    }

  # azurerm_lb_probe.probe["crime-portal-probe02-stg"] will be created
  + resource "azurerm_lb_probe" "probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/loadBalancers/crime-portal-lb-stg"
      + name                = "crime-portal-probe02-stg"
      + number_of_probes    = 3
      + port                = 443
      + probe_threshold     = 1
      + protocol            = "Https"
      + request_path        = "/"
    }

  # azurerm_lb_rule.rule["crime-portal-rule01-stg"] will be updated in-place
  ~ resource "azurerm_lb_rule" "rule" {
      ~ backend_address_pool_ids       = [
          - "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/loadBalancers/crime-portal-lb-stg/backendAddressPools/crime-portal-bap01-stg",
        ] -> (known after apply)
      ~ backend_port                   = 80 -> 443
      ~ frontend_ip_configuration_name = "crime-portal-feip01-stg" -> "crime-portal-feip02-stg"
      ~ frontend_port                  = 80 -> 443
        id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/loadBalancers/crime-portal-lb-stg/loadBalancingRules/crime-portal-rule01-stg"
      ~ load_distribution              = "SourceIP" -> "Default"
        name                           = "crime-portal-rule01-stg"
      ~ probe_id                       = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/loadBalancers/crime-portal-lb-stg/probes/crime-portal-probe01-stg" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":36,"Program":"tfcmt","SHA1":"","Target":"stg_lb","Vars":{}} -->